In [2]:
import pandas as pd

In [4]:
path = r"C:\Users\Jurgen\Desktop\PDS-Assignment-1\Assignment 2\After Cleansing"

columns = ["ite", "lasalle_diploma", "nafa_diploma", "nanyang_polytechnic", "ngee_ann_polytechnic", "republic_polytechnic", "singapore_polytechnic", "temasek_polytechnic"]
enroll = pd.read_csv(path + "\enroll_data.csv").drop(columns = columns).set_index(["year", "sex"])
intake = pd.read_csv(path + "\intake_data.csv").drop(columns = columns).set_index(["year", "sex"])
graduate = pd.read_csv(path + "\graduate_data.csv").drop(columns = columns)
graduate.year = (graduate.year)-4
graduate = graduate.set_index(["year", "sex"])

In [5]:
enroll["total"] = enroll.sum(axis=1)
intake["total"] = intake.sum(axis=1)
graduate["total"] = graduate.sum(axis=1)

In [6]:
enroll["type"] = "enroll"
intake["type"] = "intake"
graduate["type"] = "graduate"

          lasalle_degree  nafa_degree   nie   ntu   nus   sit   smu  suss  \
year sex
2010 M               123           12   607  3042  2986   653   830     0
     MF              520           25  1732  5993  6210  1236  1602     0
     F               397           13  1125  2951  3224   583   772     0
2011 M               103           13   552  2979  2987   762   799     0
     MF              363           24  1880  5756  6179  1364  1639     0
     F               260           11  1328  2777  3192   602   840     0
2012 M               121            7   552  2790  2973   746   774     0
     MF              407           25  1628  5856  6305  1285  1804     0
     F               286           18  1076  3066  3332   539  1030     0
2013 M               148           12   393  2908  3096   799   859     0
     MF              466           34  1292  6174  6446  1494  1779     0
     F               318           22   899  3266  3350   695   920     0
2014 M               110            5   310  3037  3094   995   984    56
     MF              429           15  1153  5990  6700  1744  1887   168
     F               319           10   843  2953  3606   749   903   112

          sutd  total      type
year sex
2010 M       0   8253  graduate
     MF      0  17318  graduate
     F       0   9065  graduate
2011 M     162   8357  graduate
     MF    298  17503  graduate
     F     136   9146  graduate
2012 M     153   8116  graduate
     MF    246  17556  graduate
     F      93   9440  graduate
2013 M     160   8375  graduate
     MF    267  17952  graduate
     F     107   9577  graduate
2014 M     182   8773  graduate
     MF    334  18420  graduate
     F     152   9647  graduate

In [12]:
pd.concat([enroll, intake, graduate]).to_csv(r"C:\Users\Jurgen\Desktop\PDS-Assignment-1\Assignment 2\After Cleansing\Merged.csv")